NetSuiteWebhook/NetSuiteWebhook/Files/NS_FU/Fusion/Journal/Request_Original/sampleRequest.xml

<soapenv:Envelope xmlns:jour="http://xmlns.oracle.com/apps/financials/generalLedger/journals/desktopEntry/journalImportService/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://xmlns.oracle.com/apps/financials/generalLedger/journals/desktopEntry/journalImportService/types/">
	<soapenv:Body>
		<typ:importJournals>
			<typ:interfaceRows>
				<jour:BatchName>Test Batch from API</jour:BatchName>
				<jour:BatchDescription>Test Batch from API</jour:BatchDescription>
				<jour:LedgerId>300000002335898</jour:LedgerId>
				<jour:AccountingPeriodName>Feb-21</jour:AccountingPeriodName>
				<jour:AccountingDate>2021-02-08</jour:AccountingDate>
				<jour:UserSourceName>SIS GL Interface</jour:UserSourceName>
				<jour:UserCategoryName>SIS GL Interface</jour:UserCategoryName>
				<jour:ErrorToSuspenseFlag>false</jour:ErrorToSuspenseFlag>
				<jour:SummaryFlag>false</jour:SummaryFlag>
				<jour:ImportDescriptiveFlexField>Y</jour:ImportDescriptiveFlexField>
				<!--Zero or more repetitions:-->
				<jour:GlInterface>
					<jour:Reference4>Test Journal from API</jour:Reference4>
					<jour:Reference5>Test Journal from API</jour:Reference5>
					<jour:LedgerId>300000002335898</jour:LedgerId>
					<jour:PeriodName>Feb-21</jour:PeriodName>
					<jour:AccountingDate>2021-02-08</jour:AccountingDate>
					<jour:UserJeSourceName>SIS GL Interface</jour:UserJeSourceName>
					<jour:UserJeCategoryName>SIS GL Interface</jour:UserJeCategoryName>
					<jour:Segment1>101</jour:Segment1>
					<jour:Segment2>999</jour:Segment2>
					<jour:Segment3>1111101</jour:Segment3>
					<jour:Segment4>999</jour:Segment4>
					<jour:Segment5>999</jour:Segment5>
					<jour:Segment6>9999</jour:Segment6>
					<jour:Segment7>99999</jour:Segment7>
					<jour:Segment8>99999</jour:Segment8>
					<jour:Segment9>999</jour:Segment9>
					<jour:Segment10>999</jour:Segment10>
					<jour:Segment11>9999</jour:Segment11>
					<jour:CurrencyCode>INR</jour:CurrencyCode>
					<jour:EnteredDrAmount currencyCode="INR">2000</jour:EnteredDrAmount>
					<jour:AccountedDr>2000</jour:AccountedDr>
					<jour:Reference1>Test Journal from API</jour:Reference1>
					<jour:Reference2>Test Journal from API</jour:Reference2>
					<jour:Attribute1>Test Attribute1</jour:Attribute1>
					<jour:Attribute2>Test Attribute2</jour:Attribute2>
					<jour:Attribute3>Test Attribute3</jour:Attribute3>
					<jour:Attribute4>Test Attribute4</jour:Attribute4>
					<jour:SetOfBooksId>300000002335898</jour:SetOfBooksId>
					<jour:TransactionDate>2021-02-09</jour:TransactionDate>
					<jour:GroupId>123</jour:GroupId>
				</jour:GlInterface>
				<jour:GlInterface>
					<jour:Reference4>Test Journal from API</jour:Reference4>
					<jour:Reference5>Test Journal from API</jour:Reference5>
					<jour:LedgerId>300000002335898</jour:LedgerId>
					<jour:PeriodName>Feb-21</jour:PeriodName>
					<jour:AccountingDate>2021-02-08</jour:AccountingDate>
					<jour:UserJeSourceName>SIS GL Interface</jour:UserJeSourceName>
					<jour:UserJeCategoryName>SIS GL Interface</jour:UserJeCategoryName>
					<jour:Segment1>101</jour:Segment1>
					<jour:Segment2>999</jour:Segment2>
					<jour:Segment3>1111102</jour:Segment3>
					<jour:Segment4>999</jour:Segment4>
					<jour:Segment5>999</jour:Segment5>
					<jour:Segment6>9999</jour:Segment6>
					<jour:Segment7>99999</jour:Segment7>
					<jour:Segment8>99999</jour:Segment8>
					<jour:Segment9>999</jour:Segment9>
					<jour:Segment10>999</jour:Segment10>
					<jour:Segment11>9999</jour:Segment11>
					<jour:CurrencyCode>INR</jour:CurrencyCode>
					<jour:EnteredCrAmount currencyCode="INR">1000</jour:EnteredCrAmount>
					<jour:AccountedCr>1000</jour:AccountedCr>
					<jour:Reference1>Test Journal from API</jour:Reference1>
					<jour:Reference2>Test Journal from API</jour:Reference2>
					<jour:Attribute1>Test Attribute1</jour:Attribute1>
					<jour:Attribute2>Test Attribute2</jour:Attribute2>
					<jour:Attribute3>Test Attribute3</jour:Attribute3>
					<jour:Attribute4>Test Attribute4</jour:Attribute4>
					<jour:SetOfBooksId>300000002335898</jour:SetOfBooksId>
					<jour:TransactionDate>2021-02-09</jour:TransactionDate>
					<jour:GroupId>123</jour:GroupId>
				</jour:GlInterface>
				<jour:GlInterface>
					<jour:Reference4>Test Journal from API</jour:Reference4>
					<jour:Reference5>Test Journal from API</jour:Reference5>
					<jour:LedgerId>300000002335898</jour:LedgerId>
					<jour:PeriodName>Feb-21</jour:PeriodName>
					<jour:AccountingDate>2021-02-08</jour:AccountingDate>
					<jour:UserJeSourceName>SIS GL Interface</jour:UserJeSourceName>
					<jour:UserJeCategoryName>SIS GL Interface</jour:UserJeCategoryName>
					<jour:Segment1>101</jour:Segment1>
					<jour:Segment2>999</jour:Segment2>
					<jour:Segment3>1111105</jour:Segment3>
					<jour:Segment4>999</jour:Segment4>
					<jour:Segment5>999</jour:Segment5>
					<jour:Segment6>9999</jour:Segment6>
					<jour:Segment7>99999</jour:Segment7>
					<jour:Segment8>99999</jour:Segment8>
               <jour:Segment9>999</jour:Segment9>
               <jour:Segment10>999</jour:Segment10>
               <jour:Segment11>9999</jour:Segment11>
               <jour:CurrencyCode>INR</jour:CurrencyCode>
               <jour:EnteredCrAmount currencyCode="INR">1000</jour:EnteredCrAmount>
               <jour:AccountedCr>1000</jour:AccountedCr>
               <jour:Reference1>Test Journal from API</jour:Reference1>
               <jour:Reference2>Test Journal from API</jour:Reference2>
               <jour:Attribute1>Test Attribute1</jour:Attribute1>
               <jour:Attribute2>Test Attribute2</jour:Attribute2>
               <jour:Attribute3>Test Attribute3</jour:Attribute3>
               <jour:Attribute4>Test Attribute4</jour:Attribute4>
               <jour:SetOfBooksId>300000002335898</jour:SetOfBooksId>
               <jour:TransactionDate>2021-02-09</jour:TransactionDate>
               <jour:GroupId>123</jour:GroupId>
            </jour:GlInterface>
         </typ:interfaceRows>
      </typ:importJournals>
   </soapenv:Body>
</soapenv:Envelope>

